In [1]:
import pandas as pd

In [2]:
wholesale_prices = pd.read_csv("./cleaned/millet-price.csv",encoding = "latin")
rainfall = pd.read_csv("pr_1991_2016_GHA.csv")
temperature = pd.read_csv("Monthly Average Temperature in Ghana.csv")
temperature_2 = pd.read_csv("tas_1991_2016_GHA.csv")

In [3]:
#Month array for extracting integer representations (index + 1)
month_array = {
    'JANUARY':1,
    'FEBRUARY':2,
    'MARCH':3,
    'APRIL':4,
    'MAY':5,
    'JUNE':6,
    'JULY':7,
    'AUGUST':8,
    'SEPTEMBER':9,
    'OCTOBER':10,
    'NOVEMBER':11,
    'DECEMBER':12,
    'Jan':1,
    'Feb':2,
    'Mar':3,
    'Apr':4,
    'May':5,
    'Jun':6,
    'Jul':7,
    'Aug':8,
    'Sep':9,
    'Oct':10,
    'Nov':11,
    'Dec':12
}

#### Wholesale Prices Quick Analysis

In [4]:
wholesale_prices.head()

   Unnamed: 0  Year Month   Price
0           0  1970   Jan  0.0015
1           1  1971   Jan  0.0017
2           2  1972   Jan  0.0016
3           3  1973   Jan  0.0021
4           4  1974   Jan  0.0027

In [5]:
wholesale_prices.drop(wholesale_prices.columns[0],axis=1, inplace=True);

In [6]:
wholesale_prices.columns = wholesale_prices.columns.str.strip()

In [7]:
wholesale_prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 576 entries, 0 to 575
Data columns (total 3 columns):
Year     576 non-null int64
Month    576 non-null object
Price    576 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 13.6+ KB

In [8]:
wholesale_prices['Month'] = wholesale_prices.Month.map(month_array)

In [9]:
wholesale_prices.describe()

             Year       Month       Price
count   576.00000  576.000000  576.000000
mean   1993.50000    6.500000   31.837350
std      13.86544    3.455053   55.097863
min    1970.00000    1.000000    0.001400
25%    1981.75000    3.750000    0.093150
50%    1993.50000    6.500000    1.779750
75%    2005.25000    9.250000   37.187750
max    2017.00000   12.000000  249.550000

Merge Year and Month columns into date-time format:

In [10]:
wholesale_prices['DATE'] = pd.to_datetime(wholesale_prices[['Year', 'Month']].assign(Day=1))
wholesale_prices = wholesale_prices.set_index('DATE')

In [11]:
wholesale_prices.head(12)

            Year  Month   Price
DATE
1970-01-01  1970      1  0.0015
1971-01-01  1971      1  0.0017
1972-01-01  1972      1  0.0016
1973-01-01  1973      1  0.0021
1974-01-01  1974      1  0.0027
1975-01-01  1975      1  0.0027
1976-01-01  1976      1  0.0045
1977-01-01  1977      1  0.0108
1978-01-01  1978      1  0.0170
1979-01-01  1979      1  0.0230
1980-01-01  1980      1  0.0271
1981-01-01  1981      1  0.0709

In [12]:
#Export to CSV
wholesale_prices.to_csv("./cleaned/millet_wholesale_prices.csv")

In [13]:
# wholesale_prices_per_year = wholesale_prices.groupby('YEAR')['PRICE, ¢ GH'].mean()

In [14]:
# wholesale_prices_per_year.head()

In [15]:
temperature.head()

   Temperature (C)  \tYear   Month  Country
0        25.326168    1901       1      GHA
1        28.642990    1901       2      GHA
2        28.397196    1901       3      GHA
3        28.612148    1901       4      GHA
4        27.476635    1901       5      GHA

In [16]:
temperature.columns = temperature.columns.str.strip()

In [17]:
temperature.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1344 entries, 0 to 1343
Data columns (total 4 columns):
Temperature (C)    1344 non-null float64
Year               1344 non-null int64
Month              1344 non-null int64
Country            1344 non-null object
dtypes: float64(1), int64(2), object(1)
memory usage: 42.1+ KB

In [18]:
temperature['DATE'] = pd.to_datetime(temperature[['Year', 'Month']].assign(Day=1))
temperature = temperature.set_index('DATE')

In [19]:
temperature.head()

            Temperature (C)  Year  Month Country
DATE
1901-01-01        25.326168  1901      1     GHA
1901-02-01        28.642990  1901      2     GHA
1901-03-01        28.397196  1901      3     GHA
1901-04-01        28.612148  1901      4     GHA
1901-05-01        27.476635  1901      5     GHA

In [20]:
temperature_2.columns = temperature_2.columns.str.strip()

In [21]:
temperature_2.head()

   Temperature - (Celsius)  Year Month Country  ISO3
0                  27.5450  1991   Jan   Ghana   GHA
1                  29.6491  1991   Feb   Ghana   GHA
2                  29.7984  1991   Mar   Ghana   GHA
3                  28.6725  1991   Apr   Ghana   GHA
4                  27.4803  1991   May   Ghana   GHA

In [22]:
temperature_2 = temperature_2.rename(columns={'Temperature - (Celsius)':'Temperature (C)'})

In [23]:
temperature_2['Month'] = temperature_2.Month.str.strip()

In [24]:
temperature_2['Month'] = temperature_2.Month.map(month_array)

In [25]:
temperature_2.head()

   Temperature (C)  Year  Month Country  ISO3
0          27.5450  1991      1   Ghana   GHA
1          29.6491  1991      2   Ghana   GHA
2          29.7984  1991      3   Ghana   GHA
3          28.6725  1991      4   Ghana   GHA
4          27.4803  1991      5   Ghana   GHA

In [26]:
temperature.tail()

            Temperature (C)  Year  Month Country
DATE
2012-08-01        25.499090  2012      8     GHA
2012-09-01        26.038181  2012      9     GHA
2012-10-01        26.902729  2012     10     GHA
2012-11-01        27.850910  2012     11     GHA
2012-12-01        26.496363  2012     12     GHA

In [27]:
temperature_2_above = temperature_2[temperature_2.Year > 2012]

In [28]:
temperature_2_above['DATE'] = pd.to_datetime(temperature_2_above.loc[:,['Year', 'Month']].assign(Day=1))
temperature_2_above = temperature_2_above.set_index('DATE')

/home/kayo-mest/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [29]:
temperature_2_above.drop(['Country', 'ISO3'], axis=1, inplace=True)
temperature.drop(['Country'], axis=1, inplace=True);

In [30]:
temperature_2_above.tail()

            Temperature (C)  Year  Month
DATE
2016-08-01          26.1849  2016      8
2016-09-01          26.5365  2016      9
2016-10-01          27.8165  2016     10
2016-11-01          28.5242  2016     11
2016-12-01          28.0134  2016     12

In [31]:
temperature.tail()

            Temperature (C)  Year  Month
DATE
2012-08-01        25.499090  2012      8
2012-09-01        26.038181  2012      9
2012-10-01        26.902729  2012     10
2012-11-01        27.850910  2012     11
2012-12-01        26.496363  2012     12

In [32]:
full_temp = pd.concat([temperature, temperature_2_above])

In [33]:
full_temp.tail()

            Temperature (C)  Year  Month
DATE
2016-08-01          26.1849  2016      8
2016-09-01          26.5365  2016      9
2016-10-01          27.8165  2016     10
2016-11-01          28.5242  2016     11
2016-12-01          28.0134  2016     12

In [34]:
temperature_df = full_temp['Temperature (C)'].to_frame()

In [35]:
wholesale_prices_with_temp = pd.merge(wholesale_prices, temperature_df, left_index=True, right_index=True)

In [36]:
#wholesale_prices_with_temp.COMMODITY.unique()

In [37]:
wholesale_prices_with_temp.tail()

            Year  Month   Price  Temperature (C)
DATE
2012-12-01  2012     12  139.00        26.496363
2013-12-01  2013     12  148.33        26.794700
2014-12-01  2014     12  175.94        27.092500
2015-12-01  2015     12  191.56        26.499300
2016-12-01  2016     12  193.21        28.013400

### Rainfall

In [38]:
rainfall.head()

   Rainfall - (MM)   Year  Month  Country  ISO3
0          9.81577   1991    Jan    Ghana   GHA
1         39.20720   1991    Feb    Ghana   GHA
2         67.82510   1991    Mar    Ghana   GHA
3        134.44000   1991    Apr    Ghana   GHA
4        236.53400   1991    May    Ghana   GHA

In [39]:
rainfall.columns = rainfall.columns.str.strip()

In [40]:
rainfall.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312 entries, 0 to 311
Data columns (total 5 columns):
Rainfall - (MM)    312 non-null float64
Year               312 non-null int64
Month              312 non-null object
Country            312 non-null object
ISO3               312 non-null object
dtypes: float64(1), int64(1), object(3)
memory usage: 12.3+ KB

In [41]:
rainfall['Month'] = rainfall.Month.str.strip()

In [42]:
rainfall['Month'] = rainfall.Month.map(month_array)

In [43]:
rainfall.head()

   Rainfall - (MM)  Year  Month Country  ISO3
0          9.81577  1991      1   Ghana   GHA
1         39.20720  1991      2   Ghana   GHA
2         67.82510  1991      3   Ghana   GHA
3        134.44000  1991      4   Ghana   GHA
4        236.53400  1991      5   Ghana   GHA

In [44]:
rainfall.drop(['Country','ISO3'], axis=1, inplace=True)

In [45]:
rainfall.head()

   Rainfall - (MM)  Year  Month
0          9.81577  1991      1
1         39.20720  1991      2
2         67.82510  1991      3
3        134.44000  1991      4
4        236.53400  1991      5

In [46]:
rainfall['DATE'] = pd.to_datetime(rainfall[['Year', 'Month']].assign(Day=1))
rainfall = rainfall.set_index('DATE')

In [47]:
rainfall.head()

            Rainfall - (MM)  Year  Month
DATE
1991-01-01          9.81577  1991      1
1991-02-01         39.20720  1991      2
1991-03-01         67.82510  1991      3
1991-04-01        134.44000  1991      4
1991-05-01        236.53400  1991      5

In [48]:
#Drop year and month from Rainfall
rainfall.drop(['Year','Month'],axis=1, inplace=True)

In [49]:
wholesale_prices_with_temp_and_rainfall = pd.merge(wholesale_prices_with_temp, rainfall, left_index=True, right_index=True)

In [50]:
wholesale_prices_with_temp_and_rainfall.head()

            Year  Month   Price  Temperature (C)  Rainfall - (MM)
DATE
1991-01-01  1991      1  1.3694        27.671963          9.81577
1992-01-01  1992      1  1.1844        26.237385          0.39923
1993-01-01  1993      1  1.5690        26.123363          2.41567
1994-01-01  1994      1  1.6166        27.050467          7.48651
1995-01-01  1995      1  2.1248        26.719625          0.57606

In [51]:
wholesale_prices_with_temp_and_rainfall.to_csv('./cleaned/millet_prices_with_temp_and_rainfall.csv')